#**Задание 4. Получите пользовательский ввод**
#1. Создайте файл lesson_1_task_3.py.
#2. Создайте переменную user_name.
#3. Значением переменной будет результат ввода от пользователя. 
#Используйте функцию input().
#Далее напишите команду вывода user_name на экран в формате «Привет, user_name».

user_name = input ("Ваше имя:")
print ("Привет, " + user_name)