#**Задание 5. Получите пользовательский ввод**
#1. Создайте файл lesson_1_task_4.py.
#2. Создайте переменную first_name.
#3. Создайте переменную last_name.
#4. Задайте значение обеих переменных через функцию input.
#5. Выведите на экран текст в формате «Вас зовут: last_name first_name».

first_name = input()
last_name = input()
print("Вас зовут, " + first_name  +  last_name)