#**Задание 8. Параметризация функций**
#1. Создайте файл lesson_1_task_8.py.
#2. Создайте функцию, которая принимает на вход параметр num и печатает этот параметр в консоль.
#3. Вызовите эту функцию 11 раз так, чтобы в консоль вывелся номер 88005553535.

def test(num):

    print(num, end='')

test(8)
test(8)
test(0)
test(0)
test(5)
test(5)
test(5)
test(3)
test(5)
test(3)
test(5)