#**Задание 2. Создайте переменную**
#1. Создайте файл lesson_1_task_1.py.
#2. Откройте его в VS Code.
#3. В файле создайте переменную my_name.
#4. Присвойте переменной значение — ваше имя. Помните, что строковые значения указываются в кавычках.
#5. Напишите команду вывода значения переменной на экран. Используйте функцию `print`.

my_name = "Ольга"
print (my_name)