#**Задание 8. Range**
#1. Создайте файл lesson_2_task_8.py.
#2. Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.

numbers = list(range(18, 0, -4))
print(numbers)
