#**Задание 6. Создание функции**
#1. Создайте файл lesson_1_task_6.py.
#2. Объявите функцию print_greeting().
#3. Тело функции: печать на экран выражения «Привет, мир!».
#4. Напишите код, который вызывает функцию print_greeting().
#Объявление функции (def) должно быть в коде **до** ее вызова.

def print_greeting():
    print ("Привет, мир!")

print_greeting()
