#**Задание 3. Перезапишите переменную**
#1. Создайте файл lesson_1_task_2.py.
#2. В файле создайте переменную my_age и присвойте ей значение — ваш возраст.
#3. В следующей строке присвойте этой же переменной другое значение — ваш возраст через 3 года.
#4. Напишите команду вывода значения переменной на экран. Используйте функцию `print`.

my_age = 37
my_age = my_age + 3
print (my_age)